import * as React from "react"

import './custom.css'

const IndexPage = () => {
  return (
    <div>
      <h1>හෙළ බොදු පියුම</h1>
      <p>ගාමණිය, පූර්වයෙහි රාගය පහ නොකළ රාගයෙන් බැඳුණ සත්වයෝ වෙත්ද, ඔවුන්හට නළුවා රඟ මැද නෘත්‍ය මැද ඇලීම පිණිස පවත්නාවූ යමක් වෙයි නම් එය බොහෝ සෙයින් දක්වත්. ගාමිණිය පූර්වයෙහි පහ නොකළ ද්වේෂ ඇත්තාවූ ද්වේෂයෙන් බැඳුණාවූ සත්වයෝ වෙත්ද, ඔවුන්ට නළුවා රඟ මැද නෘත්‍ය මැද ද්වේෂය පිණිස පවත්නා යමක් වෙත් නම් ඒ දේ බොහෝ සෙයින් පෙන්වයි. ගාමිණිය පෙර මෝහය පහ නොකළාවූ මෝහයෙන් බැඳුණ සත්වයෝ වෙත්ද, ඔවුන්ට නළුවා රඟ මැද නෘත්‍ය මැද මෝහය පිණිස පවත්නා යමක් වෙයි නම් එය බොහෝ සෙයින් පෙන්වයි. හෙතෙම තමන් මත්ව ප්‍රමාදව අන්‍යයන් මත්කොට ප්‍රමාදකොට ශරීරයේ බිඳීමෙන් මරණින් මතු පහාස නම් නිරයක් වේද, එහි උපදියි. ඉදින් වනාහි යමෙකුට යම් ඒ නළුවෙක් රඟමැද නෘත්‍ය මැද බොරු සැබෑ දෙකින් ජනයා සතුටු කරවයි නම්, ඇලුම් කරවයි නම්, හෙතෙම කය බිඳීමෙන් මරණින් මතු පහාස නම් දෙවියන් හා සහවාසයට පැමිණෙයි යන මෙවැනි දෘෂ්ටියක් වේද ඒ ඔහුගේ මිථ්‍යාදෘෂ්ටියක් වේ. ගාමණිය, මිථ්‍යාදෘෂ්ටික පුද්ගලයාට නිරය තිරිසන් අපාය යන දෙගතීන් අතුරින් එක්තරා ගතියක්යයි’මම කියමි.</p>
      <p>ශ්‍රී සද්ධර්මයෙන් බිඳක්</p>
    </div>
 )
}

export default IndexPage
